app/Controllers/Admin/AsignaturaController.php

SELECT *
FROM `asignaturas`
ORDER BY `id` DESC
---
    public function index()
    {
        $asignaturas = $this->asignatura->orderBy('id', 'desc')->findAll();

SELECT *
FROM `asignaturas`
WHERE `asignaturas`.`id` = 'dist'
---
    public function show($id = null)
    {
        $asignatura = $this->asignatura->find($id);