app/Controllers/Admin/EstudianteController.php

    public function index()
    {
        $estudiantes = $this->usuario->where('rol', 'estudiante')->findAll();
---
SELECT *
FROM `usuarios`
WHERE `rol` = 'estudiante'

    public function show($id = null)
    {
        $usuario = $this->usuario->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 'dist'

    public function create()
    {
        $inputs = $this->validate([
            'codigo'    => 'required|min_length[2]|max_length[10]',
            'nombre'    => 'required|min_length[2]|max_length[50]',
            'apaterno'  => 'required|min_length[2]|max_length[50]',
            'amaterno'  => 'required|min_length[2]',
            'email'     => 'required|min_length[6]|max_length[80]|valid_email|is_unique[usuarios.email]',
            'password'  => 'required|min_length[6]|max_length[255]',
            'sexo'      => 'required'
        ]);

        if (!$inputs) {
            return view('admin/estudiantes/create', ['validation' => $this->validator]);
        }

        $this->usuario->save([
            'rol'       => 'estudiante',
            'codigo'    => $this->request->getVar('codigo'),
            'nombre'    => $this->request->getVar('nombre'),
            'apaterno'  => $this->request->getVar('apaterno'),
            'amaterno'  => $this->request->getVar('amaterno'),
            'email'     => $this->request->getVar('email'),
            'password'  => $this->request->getVar('password'),
            'foto'      => $this->request->getVar('foto'),
            'sexo'      => $this->request->getVar('sexo')
        ]);
---
INSERT INTO `usuarios` (`rol`, `codigo`, `nombre`, `apaterno`, `amaterno`, `email`, `password`, `foto`, `sexo`, `created_at`, `updated_at`) VALUES ('estudiante', '2301E007', 'Patricia', 'Ochoa', 'Trujillo', 'paty@mail.com', '12345678', NULL, 'Mujer', '2023-04-12 06:57:28', '2023-04-12 06:57:28')