app/Controllers/Admin/UsuarioController.php

SELECT *
FROM `usuarios`
ORDER BY `id` DESC
---
    public function index()
    {
        $usuarios = $this->usuario->orderBy('id', 'desc')->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '10'
---
    public function show($id = null)
    {
        $usuario = $this->usuario->find($id);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '10'
---
    public function edit($id = null)
    {
        $usuario = $this->usuario->find($id);